УТ.УчетЗадач/src/Documents/cbr_ТрудозатратыПоЗадаче/cbr_ТрудозатратыПоЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>cbr_ТрудозатратыПоЗадаче</name>
  <comment>Документ устанавливующий трудозатраты по задачам сотрудников</comment>
  <basedOn>Document.cbr_Задача</basedOn>
  <registerRecords>AccumulationRegister.cbr_ЧасыТрудозатрат</registerRecords>
  <attributes>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДействий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

УТ.УчетЗадач/src/AccumulationRegisters/cbr_ЧасыТрудозатрат/cbr_ЧасыТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>cbr_ЧасыТрудозатрат</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_ОценкаЧасов/cbr_ОценкаЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ОценкаЧасов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>От</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>До</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Согласовант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОценки</name>
    <type>
      <types>EnumRef.cbr_ТипОценкиЧасов</types>
    </type>
  </resources>
  <attributes>
    <name>КомментарийОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/Enums/cbr_ТипОценкиЧасов/cbr_ТипОценкиЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>cbr_ТипОценкиЧасов</name>
  <enumValues>
    <name>Рамочная</name>
  </enumValues>
  <enumValues>
    <name>Точная</name>
  </enumValues>
  <enumValues>
    <name>ПоФакту</name>
  </enumValues>
</mdclass:Enum>

УТ.УчетЗадач/src/Documents/cbr_ТрудозатратыПоЗадаче/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьОстатокЧасов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ИсполнительПараметр = Неопределено;
	Если Параметры.Свойство("Исполнитель", ИсполнительПараметр) Тогда
		Объект.Исполнитель = ИсполнительПараметр;
	КонецЕсли;
	
	Параметры.Свойство("ИзКалендаря", ОткрытоИзКалендаря);
	
	ОбновитьОстатокЧасов();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если Объект.Проведен И ОткрытоИзКалендаря Тогда
		СтруктураРезультата = Новый Структура("Описание,Документ", Объект.ОписаниеДействий, Объект.Ссылка);
		Закрыть(СтруктураРезультата);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ОткрытоИзКалендаря Тогда
		Для Каждого Команда ИЗ КоманднаяПанель.ПодчиненныеЭлементы Цикл
			Если Команда.Имя <> "ФормаПроведение" Тогда
				Команда.Видимость = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыиФункции
&НаСервере
Процедура ОбновитьОстатокЧасов()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(cbr_ЧасыТрудозатрат.Часы, 0)) КАК Часы,
	|	cbr_ТрудозатратыПоЗадаче.Основание КАК Основание
	|ПОМЕСТИТЬ вт_ЧасыПоЗадаче
	|ИЗ
	|	Документ.cbr_ТрудозатратыПоЗадаче КАК cbr_ТрудозатратыПоЗадаче
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.cbr_ЧасыТрудозатрат КАК cbr_ЧасыТрудозатрат
	|		ПО (cbr_ЧасыТрудозатрат.Регистратор = cbr_ТрудозатратыПоЗадаче.Ссылка)
	|			И (cbr_ТрудозатратыПоЗадаче.Основание = &Задача)
	|ГДЕ
	|	cbr_ТрудозатратыПоЗадаче.Основание = &Задача
	|	И cbr_ЧасыТрудозатрат.Исполнитель = &Исполнитель
	|
	|СГРУППИРОВАТЬ ПО
	|	cbr_ТрудозатратыПоЗадаче.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(вт_ЧасыПоЗадаче.Часы, 0) КАК Часы,
	|	cbr_ОценкаЧасовСрезПоследних.До КАК До,
	|	cbr_ОценкаЧасовСрезПоследних.ТипОценки КАК ТипОценки,
	|	cbr_ОценкаЧасовСрезПоследних.От КАК От
	|ИЗ
	|	РегистрСведений.cbr_ОценкаЧасов.СрезПоследних(
	|			,
	|			Задача = &Задача
	|				И Согласовано = ИСТИНА) КАК cbr_ОценкаЧасовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЧасыПоЗадаче КАК вт_ЧасыПоЗадаче
	|		ПО (вт_ЧасыПоЗадаче.Основание = cbr_ОценкаЧасовСрезПоследних.Задача)
	|ГДЕ
	|	cbr_ОценкаЧасовСрезПоследних.Согласовано";

	Запрос.УстановитьПараметр("Задача", Объект.Основание);
	Запрос.УстановитьПараметр("Исполнитель", Объект.Исполнитель);
	
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ТипОценки = Выборка.ТипОценки;
		ВыполненныеЧасы = Выборка.Часы;
		
		Если ТипОценки = ПредопределенноеЗначение("Перечисление.cbr_ТипОценкиЧасов.Рамочная") Тогда
			ОценкаЧасов = "от " + Выборка.От + " до " + Выборка.До;	
		ИначеЕсли ТипОценки = ПредопределенноеЗначение("Перечисление.cbr_ТипОценкиЧасов.Точная") Тогда
			ОценкаЧасов = Выборка.До;
		Иначе
			Элементы.ОценкаЧасов.Видимость = Ложь;
		КонецЕсли;		
		
		Если ТипОценки = ПредопределенноеЗначение("Перечисление.cbr_ТипОценкиЧасов.Точная") Тогда
			ОстатокЧасов = Выборка.До - Выборка.Часы;
		Иначе
			Элементы.ОстатокЧасов.Видимость = Ложь;
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
